proj2/app/controllers/food_controller.rb

SELECT  "foods".* FROM "foods"  WHERE "foods"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @food = Food.find(params[:id])

SELECT  "foods".* FROM "foods"  WHERE "foods"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
    @food = Food.find(params[:id])